#+TITLE: Units, Python and Org
#+SUBTITLE: Playing with units in org
#+DATE: [2014-09-03 Wed 08:54]
#+DESCRIPTION: Some messing around with units in Python and Org.
#+SETUPFILE: ~/org-pub/topics/setup.org
#+CATEGORY: software

* Python and Pint

[[http://pint.readthedocs.org][Pint]] is a Python module to handle units.

One way to install it is:

#+BEGIN_SRC sh :results silent
  pip install --user pint
#+END_SRC

Here is an example:

#+name: uconv
#+header: :var val="10m" :var unit="inch" 
#+BEGIN_SRC python
  import pint
  units = pint.UnitRegistry()
  return units.Quantity(val).to(unit)
#+END_SRC

#+RESULTS: uconv
: 393.700787402 inch

#+call: uconv("2.54cm","inch")

#+RESULTS:
: 1.0 inch

